BAS BMEKZU Project/src/Documents/АктСверкиВзаиморасчетов/АктСверкиВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктСверкиВзаиморасчетов</name>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СверкаСогласована</name>
    <comment>Признак согласования сверки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокНаНачало</name>
    <comment>(Общ) Остаток на начало </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расхождение</name>
    <comment>(Общ) Расхождение</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительОрганизации</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительКонтрагента</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьПолныеНазванияДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазбитьПоДоговорам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоДаннымОрганизации</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
        <types>DocumentRef.ПередачаОС</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ГТДИмпорт</types>
        <types>DocumentRef.СписаниеСРасчетногоСчета</types>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ОперацияБух</types>
        <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
        <types>DocumentRef.ПоступлениеНМА</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
        <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
        <types>DocumentRef.ИНАГРО_ВедомостьРеализация</types>
        <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
        <types>DocumentRef.ОтчетКомитентуОПродажах</types>
        <types>DocumentRef.ЗакрытиеМесяца</types>
        <types>DocumentRef.ПередачаНМА</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ПоступлениеИзПереработки</types>
        <types>DocumentRef.РеализацияУслугПоПереработке</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.ПоступлениеДопРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дебет</name>
      <comment>(Общ) Дебет: увеличение долга контрагента</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кредит</name>
      <comment>(Общ) Кредит: увеличение долга организации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоДаннымКонтрагента</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
        <types>DocumentRef.ПередачаОС</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ГТДИмпорт</types>
        <types>DocumentRef.СписаниеСРасчетногоСчета</types>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ОперацияБух</types>
        <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
        <types>DocumentRef.ПоступлениеНМА</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
        <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
        <types>DocumentRef.ИНАГРО_ВедомостьРеализация</types>
        <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
        <types>DocumentRef.ОтчетКомитентуОПродажах</types>
        <types>DocumentRef.ЗакрытиеМесяца</types>
        <types>DocumentRef.ПередачаНМА</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ПоступлениеИзПереработки</types>
        <types>DocumentRef.РеализацияУслугПоПереработке</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.ПоступлениеДопРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дебет</name>
      <comment>(Общ) Дебет: увеличение долга контрагента</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кредит</name>
      <comment>(Общ) Кредит: увеличение долга организации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокСчетов</name>
    <comment>Список счетов, участвующих в расчетах</comment>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>УчаствуетВРасчетах</name>
      <comment>Признак использования счета при проведении сверки</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/Documents/АктСверкиВзаиморасчетов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем мВалютаРегламентированногоУчета;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	// Заполняем счета учета взаиморасчетов
	ТаблицаСчетов = УчетВзаиморасчетов.ПолучитьТаблицуСчетовУчетаВзаиморасчетов(Истина,Ложь);
	ТаблицаСчетов.Колонки.СчетРасчетов.Имя = "Счет";
	ТаблицаСчетов.Колонки.Добавить("УчаствуетВРасчетах", Новый ОписаниеТипов("Булево"));
	ТаблицаСчетов.ЗаполнитьЗначения(Истина, "УчаствуетВРасчетах");
	СписокСчетов.Загрузить(ТаблицаСчетов);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначенияБП.ПолучитьРабочуюДату());
	Ответственный = Пользователи.ТекущийПользователь();

	СтруктураКурсаВзаиморасчетов = РаботаСКурсамиВалют.ПолучитьКурсВалюты(
	ВалютаДокумента, Дата);
	
	КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
	КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) 
		И ДатаНачала > ДатаОкончания Тогда
	
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Поле", "Корректность",
			НСтр("ru='Период по';uk='Період до'"), , , 
			НСтр("ru='Дата окончания периода сверки должна быть больше даты начала.';uk='Дата закінчення періоду звірки повинна бути більше дати початку.'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ДатаОкончания", "Объект", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
#КонецЕсли
